In [1]:
import pandas as pd

# From python list

In [2]:
data = [
    ["Dhruv" , 85],
    ["Ganesh" , 90],
    ["Jay" , 52]
]

In [3]:
df = pd.DataFrame(data , columns=["Namme" , "Marks"])

In [4]:
df

    Namme  Marks
0   Dhruv     85
1  Ganesh     90
2     Jay     52

# From Dictionary of Lists

In [5]:
data = {
    "Name" : ["Dhruv" , "Akshay" , "aryan"],
    "Age" : [25,35,55]    
}

In [6]:
df= pd.DataFrame(data)

In [7]:
df

     Name  Age
0   Dhruv   25
1  Akshay   35
2   aryan   55

# From NumPy Arrays

In [8]:
import numpy as np

In [9]:
data = np.array([[1,2],[6,7]])

In [10]:
df = pd.DataFrame(data , columns=["A" , "B"])

In [11]:
df

   A  B
0  1  2
1  6  7

# From Excel File

In [12]:
data = pd.read_excel("data.xlsx")

In [13]:
data

  Student School  marks
0   Dhruv    LJS     97
1    Jack    PUS     45
2  Denial    RJD     45
3    Rock    BJS     78
4   Roman    RCS     66
5  Lisban    CKP     90
6   khali    WBK     39
7   Muzan    CRS     61

# From CSV file

In [14]:
data = pd.read_csv("data.csv")

In [15]:
data

  Student School  marks
0   Dhruv    LJS     97
1    Jack    PUS     45
2  Denial    RJD     45
3    Rock    BJS     78
4   Roman    RCS     66
5  Lisban    CKP     90
6   khali    WBK     39
7   Muzan    CRS     61

# From JSON file

In [16]:
data = pd.read_json("data.json")

In [17]:
data

   id   product  price
0   1    Laptop   1200
1   2     Mouse     25
2   3  Keyboard     75

# From URL

In [18]:
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv"
df = pd.read_csv(url)

In [19]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

## EDA for upper dataset

In [20]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [21]:
df.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [22]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [24]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [25]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [26]:
df.shape

(244, 7)